<template>
  <svg t="1753240836914" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
       p-id="10119" xmlns:xlink="http://www.w3.org/1999/xlink" width="200" height="200">
    <path
        d="M530.432 945.3568A434.176 434.176 0 0 1 491.52 78.6432a40.96 40.96 0 0 1 26.0096 70.8608 261.7344 261.7344 0 0 0-83.5584 192.3072 266.24 266.24 0 0 0 266.24 266.24 262.3488 262.3488 0 0 0 191.6928-82.944s0 1.024 0 0a40.96 40.96 0 0 1 70.656 24.576 434.176 434.176 0 0 1-432.128 395.6736z m0 0"
        p-id="10120"></path>
  </svg>
</template>

<script setup>   // 这里不需要额外逻辑，仅用于封装 SVG 图标
</script>